L = 0.3;           %длина струны
time = 1;          %время
T = 1;             %натяжение струны
p = 0.1;           %плотность
N = 100;           %число точек разбиения по x
M = 100;           %число точек разбиения по t

h = L/N;           %подсчет шага по x
tau = time/M;      %подсчет шага по t

x(1)=0;            %построение сетки
for i=2:N+1
    x(i)=x(i-1) + h;
end
t(1)=1;
for j=2:M+1
    t(j)=t(j-1) + tau;
end
     
b = -T/p*tau*tau;        %коэффициенты основного уравнения
c = h*h+2*T/p*tau*tau;
d = -tau*tau*T/p;
a = 1;                   %коэффициенты первого граничного условия
z = 1;                   %коэффициенты второго граничного условия

A = zeros (N+1);         %построение 3-х диагональной матрицы
A(1,1) = a;
for i=2:N
    A(i,i-1) = d;    
    A(i,i) = c;
    A(i,i+1) = b;
end
A(N+1,N+1) = z;

for i=1:N+1              %запись начальных условий
    U(1,i) = Fi(x(i));
    U(2,i) = tau * Psi(x(i)) + U(1,i);
end

for j=3:M+1              %решение краевой задачи
    D(1)=Alfa(t(j));
    D(N+1)=Beta(t(j));
    for i=2:N-1
        D(i) = h*h*tau*tau*((F(x(i),t(j)))/p) + 2*h*h*U(j-1,i)-h*h*U(j-2,i);        
    end
    Y = Progonka(A,D,N);   % вызываем модуль прогонки
    for s=1:N+1
        U(j,s) = Y(s);              
    end
end;

figure(1);                  %график струны в различные моменты времени
plot(x,U(1,:));          
AXIS([0 0.3 -0.03 0.03]);
figure(2);
plot(x,U(29,:));          
AXIS([0 0.3 -0.03 0.03]);
figure(3);
plot(x,U(60,:));          
AXIS([0 0.3 -0.03 0.03]);
figure(4);
plot(x,U(70,:));          
AXIS([0 0.3 -0.03 0.03]);
figure(5);
plot(x,U(98,:));          
AXIS([0 0.3 -0.03 0.03]);
figure(6);                  %график поверхности
surf(x,t,U);









